test/load-test.yml
config:
  target: "http://18.221.138.161:8081"
  phases:
    - duration: 120
      arrivalRate: 30
  processor: "./load-test.js"
  environments:
    dev:
      target: "http://127.0.0.1:8081"
      phases:
        - duration: 10
          arrivalRate: 2
    eventuate-customers:
      target: "http://18.221.138.161:8081"
      phases:
        - duration: 120
          arrivalRate: 10
    axon-orders:
      target: "http://18.221.138.161:8080"
      phases:
        - duration: 1200
          arrivalRate: 20
scenarios:
  - name: "Axon: Order"
    flow:
      - post:
        url: "/api/order"
        beforeRequest: "createOrder"
        afterResponse: "logResponse"
        capture:
          header: ""
          as: "id"

  # - name: "Eventuate: Create user and check if created"
  #   flow:
  #     - post:
  #         url: "/customers"
  #         beforeRequest: "createCustomer"
  #         afterResponse: "logCustomerID"
  #         capture:
  #           json: "$.customerId"
  #           as: "id"
  #     - get:
  #         url: "/customers/{{ id }}"